[{"paperId": "a92be14fbb6638142c31189a16d1efb984597c77", "externalIds": {"DOI": "10.48175/ijarsct-5682", "CorpusId": 250364723}, "title": "Big Data: A Transition from Conventional Databases", "abstract": "The primary programming language created to manage data contained in database systems is called Structured Query Language (SQL). SQL was initially solely used with relational database management systems (RDBMS), but as additional categories of database systems have emerged, its use has substantially expanded. When processing Big Data, or datasets with great volume, velocity, and variety, highly distributed and scalable systems have been proven to be particularly effective at using SQL as a query language. Although conventional relational databases currently only make up a small portion of the database systems landscape, the majority of database courses that cover SQL only take traditional relational systems into account when using SQL. In this study, we suggest that SQL be taught as a general language, which can be applied to a variety of database systems, ranging from conventional RDBMSs to Big Data systems. In the context of emerging database systems like MapReduce, NoSQL, and NewSQL, this paper offers well-organized suggestions for introducing SQL. The description of a variety of course tools, such as virtual machines, sample projects, and in-class exercises, to provide hands-on experience with SQL across a wide range of contemporary database systems is a fundamental addition of this work. Descriptors for Categories and Subjects General terms for computer and information science education in K.3.2 [Computers and Education] Creating and experimenting Keywords Curriculums for databases; SQL; Query Language; Big Data 1.", "venue": null, "year": 2022, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "s2-fos-model"}], "journal": {"name": "Association for Computing Machinery (ACM)", "volume": 0}, "authors": [{"authorId": "2175376504", "name": "Sahil Gupta"}], "country": "Belgium", "city": "Brussels", "reviewers": ["2181606", "1574076249", "9736760"]}, {"paperId": "c50c789c77e097754ed41720f9a4c9bb49712758", "externalIds": {"DOI": "10.48175/ijarsct-5489", "CorpusId": 250271037}, "title": "Exploring the Path to Big Data Analytics Success in Health Care", "abstract": "Like Oxygen, the world is surrounded by data today. The quantity of data that we harvest and eat up is thriving aggressively in the digitized world. Increasing use of new innovations and social media generate vast amount of data that can earn splendid information if properly analyzed. This large dataset generally known as big data, do not fit in traditional databases because of its rich size. Big Data is a collection of data that is huge in volume, yet growing exponentially with time. It is a data with so large size and complexity that none of traditional data management tools can store it or process it efficiently. Organizations need to manage and analyze big data for better decision making and outcomes. So, big data analytics is receiving a great deal of attention today. In healthcare, big data analytics has the possibility of advanced patient care and clinical decision support. In this paper, we review the background and the various methods of big data analytics in healthcare. This paper also elaborates various platforms and algorithms for big data analytics and discussion on its advantages and challenges. This survey winds up with a discussion of challenges and future directions.", "venue": null, "year": 2022, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "s2-fos-model"}], "journal": {"name": "American Institute of Physics (AIP)", "volume": 5}, "authors": [{"authorId": "2174761110", "name": "Preshita Mahendra Panshikar"}, {"authorId": "2174421321", "name": "Prof. Divakar Jha"}], "country": "Italy", "city": "Rome", "reviewers": ["2153612625", "2149265807"]}, {"paperId": "313eff347f37b28d2f6d608aa666e1d42bfb30b0", "externalIds": {"MAG": "2773693972", "DOI": "10.14257/IJCA.2017.10.11.15", "CorpusId": 168830410}, "title": "U-healthcare Big Data Analytics Process Control", "abstract": "ykchung@kiu.ac.kr Abstract Big data analytics made its way beyond expectation due to its huge potential applied in various areas such as science and technology. As to healthcare is concerned, data is becoming more complex and is difficult to process in the long run. How to manage data has been an important issue to resolve. New development was also successful in collecting and storing healthcare data anytime remotely, hence the ubiquitous healthcare systems. Big data analytics has the potential to transform the way healthcare providers use sophisticated technologies to gain insight from their clinical and other data repositories and make informed decisions. In this study, we will discuss the use and application of big data analytics for u-healthcare. We have presented architecture to address the mentioned challenges in this study by improving the current process of data storage through encryption and setting access", "venue": "Agent Conf", "year": 2017, "s2FieldsOfStudy": [{"category": "Business", "source": "external"}, {"category": "Computer Science", "source": "s2-fos-model"}, {"category": "Medicine", "source": "s2-fos-model"}], "journal": null, "authors": [{"authorId": "51292773", "name": "M. G. Zaragoza"}, {"authorId": "33786068", "name": "Haeng-Kon Kim"}, {"authorId": "2720222", "name": "Youn-ky Chung"}], "country": "Germany", "city": "Berlin", "edition": 3, "reviewers": ["2830560", "2175376504", "8380281", "8380281"]}, {"paperId": "f8e32e5d3f2ff8c9cb6d287d994f75d49e581fed", "externalIds": {"DOI": "10.1109/tkde.2013.109", "CorpusId": 18886861}, "title": "Data Mining with Big Data", "abstract": "In an Information technology world, the ability to effectively process massive datasets has become integral to a broad range of scientific and other academic disciplines. We are living in an era of data deluge and as a result, the term “Big Data” is appearing in many contexts. It ranges from meteorology, genomics, complex physics simulations, biological and environmental research, finance and business to healthcare. Big Data refers to data streams of higher velocity and higher variety. The infrastructure required to support the acquisition of Big Data must deliver low, predictable latency in both capturing data and in executing short, simple queries. To be able to handle very high transaction volumes, often in a distributed environment; and support flexible, dynamic data structures. Data processing is considerably more challenging than simply locating, identifying, understanding, and citing data. For effective large-scale analysis all of this has to happen in a completely automated manner. This requires differences in data structure and semantics to be expressed in forms that are computer understandable, and then “robotically” resolvable. There is a strong body of work in data integration, mapping and transformations. However, considerable additional work is required to achieve automated error-free difference resolution. This paper proposes a framework on recent research for the Data Mining using Big Data.", "venue": "Voxxed Days - Zurich", "year": 2017, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "s2-fos-model"}], "journal": null, "authors": [{"authorId": "1574076249", "name": "S. R"}, {"authorId": "9736760", "name": "S. R"}], "country": "Belgium", "city": "Brussels", "edition": 0, "reviewers": ["2174421321", "8380281", "2174761110"]}, {"paperId": "4ee8fa7b8777ab3a050afd4e2a019d08084930f2", "externalIds": {"DBLP": "journals/iam/WuLCL16", "MAG": "2498229780", "DOI": "10.1016/j.im.2016.07.003", "CorpusId": 28684580}, "title": "The promising future of healthcare services: When big data analytics meets wearable technology", "abstract": null, "venue": null, "year": 2016, "s2FieldsOfStudy": [{"category": "Business", "source": "external"}, {"category": "Computer Science", "source": "external"}, {"category": "Business", "source": "s2-fos-model"}], "journal": {"name": "American Institute of Physics (AIP)", "pages": "1020-1033", "volume": "53"}, "authors": [{"authorId": "2149265807", "name": "Jing Wu"}, {"authorId": "2153612625", "name": "He Li"}, {"authorId": "8380281", "name": "Sherri Cheng"}, {"authorId": "2830560", "name": "Zhangxi Lin"}], "country": "Belgium", "city": "Brussels", "reviewers": ["51292773", "2174761110", "39060992"]}, {"paperId": "94b2467292c2757b1e9758fabe5d304a4c818270", "externalIds": {"MAG": "2261525379", "DBLP": "journals/ijinfoman/GandomiH15", "DOI": "10.1016/J.IJINFOMGT.2014.10.007", "CorpusId": 5120196}, "title": "Beyond the hype: Big data concepts, methods, and analytics", "abstract": null, "venue": null, "year": 2015, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "external"}, {"category": "Computer Science", "source": "s2-fos-model"}], "journal": {"name": "American Institute of Aeronautics and Astronautics (AIAA)", "pages": "137-144", "volume": "35"}, "authors": [{"authorId": "1764455", "name": "A. Gandomi"}, {"authorId": "39060992", "name": "Murtaza Haider"}], "country": "United Kingdom", "city": "London", "reviewers": ["1696238", "2181606"]}, {"paperId": "c668fd61633a628bb87d2ec5239269a49f3e53fb", "externalIds": {"DBLP": "journals/fgcs/ZhangCKLH15", "MAG": "2124794572", "DOI": "10.1016/j.future.2014.06.009", "CorpusId": 74486}, "title": "A task-level adaptive MapReduce framework for real-time streaming data in healthcare applications", "abstract": null, "venue": null, "year": 2015, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "external"}, {"category": "Computer Science", "source": "s2-fos-model"}], "journal": {"name": "American Physical Society (APS)", "pages": "149-160", "volume": "43-44"}, "authors": [{"authorId": "47191237", "name": "Fan Zhang"}, {"authorId": "1721727", "name": "Junwei Cao"}, {"authorId": "1740261", "name": "S. Khan"}, {"authorId": "2181606", "name": "Keqin Li"}, {"authorId": "145243732", "name": "K. Hwang"}], "country": "Italy", "city": "Rome", "reviewers": ["2149265807"]}, {"paperId": "dac7344737cb824634f757aede2dd46a6eed204b", "externalIds": {"DBLP": "journals/hisas/RaghupathiR14", "MAG": "2120751691", "PubMedCentral": "4341817", "DOI": "10.1186/2047-2501-2-3", "CorpusId": 388276, "PubMed": "25825667"}, "title": "Big data analytics in healthcare: promise and potential", "abstract": null, "venue": "The Rolling Scopes Conference", "year": 2014, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "external"}, {"category": "Medicine", "source": "external"}, {"category": "Medicine", "source": "s2-fos-model"}, {"category": "Sociology", "source": "s2-fos-model"}], "journal": null, "authors": [{"authorId": "1696238", "name": "W. Raghupathi"}, {"authorId": "2742266", "name": "V. Raghupathi"}], "country": "United Kingdom", "city": "London", "edition": 0, "reviewers": ["2830560", "9736760"]}, {"paperId": "b93109664af446b130dae42ecff7966842940d4c", "externalIds": {"DBLP": "journals/pvldb/LabrinidisJ12", "MAG": "2165093166", "DOI": "10.14778/2367502.2367572", "CorpusId": 7456272}, "title": "Challenges and Opportunities with Big Data", "abstract": "The promise of data-driven decision-making is now being recognized broadly, and there is growing enthusiasm for the notion of \"Big Data,\" including the recent announcement from the White House about new funding initiatives across different agencies, that target research for Big Data. While the promise of Big Data is real -- for example, it is estimated that Google alone contributed 54 billion dollars to the US economy in 2009 -- there is no clear consensus on what is Big Data. In fact, there have been many controversial statements about Big Data, such as \"Size is the only thing that matters.\" In this panel we will try to explore the controversies and debunk the myths surrounding Big Data.", "venue": "Agent Conf", "year": 2012, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "external"}, {"category": "Computer Science", "source": "s2-fos-model"}], "journal": null, "authors": [{"authorId": "1716685", "name": "Alexandros Labrinidis"}, {"authorId": "145531067", "name": "H. Jagadish"}], "country": "Italy", "city": "Rome", "edition": 2, "reviewers": ["2742266", "79367674", "145252461"]}, {"paperId": "f4de0213b4a5777ff39d5a94cd574713799ca221", "externalIds": {"MAG": "2163215699", "DOI": "10.5120/7228-0076", "CorpusId": 4996681}, "title": "Improved Study of Heart Disease Prediction System using Data Mining Classification Techniques", "abstract": "Healthcare industry is generally \"information rich\", but unfortunately not all the data are mined which is required for discovering hidden patterns & effective decision making. Advanced data mining techniques are used to discover knowledge in database and for medical research, particularly in Heart disease prediction. This paper has analysed prediction systems for Heart disease using more number of input attributes. The system uses medical terms such as sex, blood pressure, cholesterol like 13 attributes to predict the likelihood of patient getting a Heart disease. Until now, 13 attributes are used for prediction. This research paper added two more attributes i.e. obesity and smoking. The data mining classification techniques, namely Decision Trees, Naive Bayes, and Neural Networks are analyzed on Heart disease database. The performance of these techniques is compared, based on accuracy. As per our results accuracy of Neural Networks, Decision Trees, and Naive Bayes are 100%, 99.62%, and 90.74% respectively. Our analysis shows that out of these three classification models Neural Networks predicts Heart disease with highest accuracy.", "venue": null, "year": 2012, "s2FieldsOfStudy": [{"category": "Computer Science", "source": "external"}, {"category": "Computer Science", "source": "s2-fos-model"}], "journal": {"name": "American Fisheries Society (AFS)", "pages": "44-48", "volume": "47"}, "authors": [{"authorId": "79367674", "name": "Chaitrali S. Dangare"}, {"authorId": "145252461", "name": "S. Apte"}], "country": "Spain", "city": "Barcelona", "reviewers": ["51292773", "51292773"]}]